20160427-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-27 Wed 23:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes for emacs-berlin meetup on 27.04.2016</title>
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Notes for emacs-berlin meetup on 27.04.2016</h1>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> How to submit a patch to emacs mailing list?</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>ping john wiegley</li>
<li>send a screenshot</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Who runs emacs tests? CI?</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Andreas already got some CI emails?</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> general-close</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>it's being used!</li>
<li>try it on melpa</li>
<li>Andreas demonstrates general-close implementation
<ul class="org-ul">
<li>suggestion to use pcase</li>
</ul></li>
<li>needs autoloads
<ul class="org-ul">
<li>add ;;;###autoload before all command defuns</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Parenthesis fu</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>smartparens</li>
<li>slurping (swallowing stuff into enclosing parens)</li>
<li>check-parens</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> We need an xrandr interface in emacs.</h2>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> Arne is writing curriculum for beginners</h2>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> projectile-ag</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>ag is an alternative to grep</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">8</span> How to build stuff on Travis</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>emacs support</li>
<li>ycmd as an example</li>
<li><a href="https://github.com/abingham/emacs-ycmd/blob/master/.travis.yml">ycmd at github</a></li>
<li>using cask for package management</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">9</span> cask</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>useful for developing emacs packages</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">10</span> eshell</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>you can run emacs commandst here</li>
<li>no one attending has managed to entirely switch to eshell</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">11</span> Reimplement emacs for JVM?</h2>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">12</span> Discussion about thing-at-point-utils</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>by Andreas</li>
<li><a href="https://github.com/andreas-roehler/werkstatt/tree/master/thing-at-point-utils">at github</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-04-27 Wed 23:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
